## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       RESOURCE                        |
|----------|-------------------------------------------------------|
| add      | `aws_cloudwatch_metric_alarm.ses_bounce_rate_high`    |
|          | `aws_cloudwatch_metric_alarm.ses_complaint_rate_high` |
| recreate | `aws_network_acl_rule.smtp_ssl_egress`                |
|          | `aws_network_acl_rule.smtp_ssl_ingress`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.ses_bounce_rate_high will be created
  + resource "aws_cloudwatch_metric_alarm" "ses_bounce_rate_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "SES Warning - bounce rate >=7% over the last 12 hours"
      + alarm_name                            = "ses-bounce-rate-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Reputation.BounceRate"
      + namespace                             = "AWS/SES"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok",
        ]
      + period                                = 43200
      + region                                = "ca-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 0.07
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.ses_complaint_rate_high will be created
  + resource "aws_cloudwatch_metric_alarm" "ses_complaint_rate_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "SES Warning - complaint rate >=0.4% over the last 12 hours"
      + alarm_name                            = "ses-complaint-rate-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Reputation.ComplaintRate"
      + namespace                             = "AWS/SES"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok",
        ]
      + period                                = 43200
      + region                                = "ca-central-1"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 0.004
      + treat_missing_data                    = "notBreaching"
    }

  # aws_network_acl_rule.smtp_ssl_egress must be replaced
-/+ resource "aws_network_acl_rule" "smtp_ssl_egress" {
      ~ from_port       = 465 -> 587 # forces replacement
      ~ id              = "nacl-1133108709" -> (known after apply)
      ~ protocol        = "6" -> "tcp"
      ~ to_port         = 465 -> 587 # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_network_acl_rule.smtp_ssl_ingress must be replaced
-/+ resource "aws_network_acl_rule" "smtp_ssl_ingress" {
      ~ from_port       = 465 -> 587 # forces replacement
      ~ id              = "nacl-1094135151" -> (known after apply)
      ~ protocol        = "6" -> "tcp"
      ~ to_port         = 465 -> 587 # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 14 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_bounce_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_complaint_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
